app/controllers/activities_controller.rb

INSERT INTO "activities" ("title", "expense_type", "amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "jmfhjfmfhm"], ["expense_type", "Debit"], ["amount", "12.11"], ["user_id", 1], ["created_at", "2015-07-08 16:22:51.556333"], ["updated_at", "2015-07-08 16:22:51.556333"]]
---
	def create
		@activity = @user.activities.create(activities_params)

SELECT  "activities".* FROM "activities" WHERE "activities"."user_id" = $1 AND "activities"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 11]]
---
	def edit
		@activity = @user.activities.find(params[:id])

UPDATE "activities" SET "title" = $1, "amount" = $2, "updated_at" = $3 WHERE "activities"."id" = $4  [["title", "Hey there"], ["amount", "121.25"], ["updated_at", "2015-07-08 22:07:25.930988"], ["id", 11]]
---
	def update
		@activity.update_attributes(activities_params)

DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 10]]
---
	def destroy
		@activity.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
	def find_user
		@user = User.find(params[:user_id])

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT 1  [["id", 11]]
---
	def find_activity
		@activity = Activity.find(params[:id])