app/controllers/home_controller.rb

SELECT "activities"."amount" FROM "activities" WHERE "activities"."user_id" = $1 AND "activities"."expense_type" = $2  [["user_id", 3], ["expense_type", "Debit"]]
---
	def index
		if current_user
			user = current_user
			@activities = user.activities
			@debits = user.activities.where(expense_type: "Debit").pluck(:amount).inject(:+)