app/controllers/home_controller.rb

	def index
		if current_user
			user = current_user
			@activities = user.activities
			@debits = total_debit
			@credits = total_credit

			@bills = user.activities.where(category: "Bills")
---
SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = $1 AND "activities"."category" = $2  [["user_id", 1], ["category", "Bills"]]